{
  "1984": "George Orwell’s novel follows Winston Smith in a state that polices thought, rewrites history, and monitors its citizens. Winston’s small acts of resistance—seeking truth, keeping a diary, and falling in love—place him against a machine built to shatter individuality. The story examines how language, fear, and surveillance can bend reality and erode freedom.",
  "The Hobbit": "Bilbo Baggins is recruited by Gandalf and a band of dwarves to reclaim a treasure guarded by the dragon Smaug. Leaving his cozy home, Bilbo grows from a reluctant participant into a quick, brave, and resourceful companion. The journey reveals hidden strengths, unlikely friendships, and the cost and thrill of adventure.",
  "To Kill a Mockingbird": "Through Scout Finch’s childlike yet perceptive narration, we witness a racially charged trial in a Depression-era Southern town. Her father, Atticus, defends an innocent Black man, modeling moral courage and empathy in the face of prejudice. The novel explores justice, compassion, and the lessons that shape a child’s understanding of right and wrong.",
  "The Catcher in the Rye": "Holden Caulfield roams New York City after leaving school, wrestling with grief for his brother, the phoniness he sees in adults, and his fear of change. His protective impulse toward children—symbolized by the fantasy of catching them before they fall—exposes his longing for innocence amid loss and uncertainty.",
  "Brave New World": "In Huxley’s engineered society, people are conditioned for contentment through pleasure, entertainment, and stability. Individuality and deep emotion are traded for predictability. When outsiders disrupt this balance, the cost of a painless life—numbness, conformity, and the loss of meaning—becomes starkly visible.",
  "The Lord of the Rings": "Frodo and companions must destroy the One Ring before it enslaves Middle-earth. Their journey spans battles, betrayals, and moments of grace, showing that even the smallest person can change the course of the future. Friendship and sacrifice are the heart that sustains hope against overwhelming darkness.",
  "Harry Potter and the Sorcerer's Stone": "Harry learns he is a wizard and attends Hogwarts, where he forms strong friendships and faces early tests of courage. As he uncovers the truth about his past and the dark wizard who seeks power, Harry chooses loyalty and bravery over fear, setting the tone for the conflicts to come.",
  "The Book Thief": "Narrated by Death, the novel follows Liesel in Nazi Germany as she steals books and learns the power of words. Amidst danger and loss, the kindness of neighbors and the resilience of stories keep hope alive. The book examines how language can wound and heal.",
  "The Alchemist": "Santiago pursues a dream of treasure in Egypt, meeting mentors who teach him to read the world’s signs. His quest becomes an inner journey toward purpose and faith in his own heart. The lesson is that seeking one’s personal legend transforms the seeker more than the prize.",
  "Dune": "On Arrakis, control of a rare spice drives politics, faith, and survival. Paul Atreides is thrust into exile and prophecy, forging alliances with desert people and confronting the burden of being seen as a savior. The novel blends adventure with reflections on ecology, power, and fate.",
  "The Little Prince": "Stranded in the desert, a pilot meets a child from another world who tells of visits to odd planets and lonely adults. Their conversations reveal that what truly matters is invisible to the eye: love, responsibility, and the bonds we tend to forget as we grow up.",
  "Fahrenheit 451": "Guy Montag burns books for a living until encounters with a curious neighbor and hidden texts awaken his doubts. As he witnesses a society dulled by screens and speed, he risks everything to preserve thought and memory. The story champions curiosity and the courage to think freely."
}
